import type { City } from './types';

export const CITIES: City[] = [
  {
    id: 'moscow',
    name: 'Москва',
    description: 'Доставка контейнера с грузом из Москвы в Калининград.',
    additionalInfo: 'Закажите быструю перевозку из столицы в Калининград по самым привлекательным ценам на рынке, начиная от ',
    price: '300 000 ₽!',
  },
  {
    id: 'spb',
    name: 'Санкт-Петербург',
    description: 'Доставка Вашего груза из Санкт-Петербурга в Калиниград.',
    additionalInfo: 'Оперативно доставим Ваш груз в любую точку Калининградской области по схеме "Дверь-Дверь" по самым оптимальным ценам буквально от ',
    price: '230 000 ₽!'
  },
  {
    id: 'othercity',
    name: 'Ваш город',
    description: 'Доставка груза в Калининград из любого города России.',
    additionalInfo: 'Быстро доставим Ваш груз в Калининград из любой точки страны. Свяжитесь с нами, чтобы получить лучшее предложение!',
  }
] 


export const ANIMATION = {
  DURATION: 400, // ms
  EASING: 'cubic-bezier(0.4, 0, 0.2, 1)', // Material Design easing
} as const;
